#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Отец', 'Мать','Бабушка', 'Дедушка']


# список списков приблизителного роста членов вашей семьи
my_family_height = [
    # ['имя', рост],
    ['Отец', 185],
    ['Мать', 165],
    ['Бабушка', 160],
    ['Дедушка', 175],
]


# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
father_height = 0
for person in my_family_height:
    if person[0] == 'Отец':
        father_height = person[1]
        break
print('Рост отца –', father_height, 'см')
# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
total_height = 0
for person in my_family_height:
    total_height += person[1]
print('Общий рост моей семьи –', total_height, 'см')